
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       3 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                      |
|:--------:|:---------------------------------------------------------------|
|    🟢     | `aws_iam_access_key.tmp`                                       |
|    🟢     | `aws_iam_user.tmp`                                             |
|    🟢     | `aws_iam_user_policy_attachment.tmp`                           |
|    🟢     | `data.aws_iam_policy_document.ih-tf-terraform-control-assume:` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/0be6c63c-0ea6-4ffb-bd50-2d60d6b5cd23/terraform-bin plan -no-color -var-file=configuration.tfvars --out=tf.plan
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1268673852]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Reading...
data.aws_iam_policy_document.allow-assume: Reading...
data.aws_iam_policy.administrator-access: Reading...
aws_iam_user.aleks: Refreshing state... [id=aleks]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Reading...
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
module.mediapc.aws_s3_bucket.dst: Refreshing state... [id=twindb20230824154451928300000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2054866892]
data.aws_iam_policy_document.allow-assume: Read complete after 0s [id=2219106455]
aws_iam_policy.allow-assume: Refreshing state... [id=arn:aws:iam::990466748045:policy/allow-assume]
module.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::990466748045:policy/ih-tf-aws-control-github]
module.mediapc.data.aws_iam_policy_document.backuper-permissions: Reading...
module.mediapc.aws_iam_user.backuper: Refreshing state... [id=twindb20230824154451928300000001]
module.mediapc.data.aws_iam_policy_document.backuper-permissions: Read complete after 0s [id=2836020957]
module.mediapc.aws_iam_policy.backuper: Refreshing state... [id=arn:aws:iam::990466748045:policy/terraform-20230824154453948900000002]
data.aws_iam_policy_document.aws-admin: Reading...
aws_iam_access_key.aleks: Refreshing state... [id=AKIA6NHDLF2G665VS5V2]
data.aws_iam_policy_document.aws-admin: Read complete after 0s [id=2092112735]
aws_iam_role.aws-admin: Refreshing state... [id=aws-admin]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=1250416815]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-github]
module.mediapc.aws_iam_access_key.backuper: Refreshing state... [id=AKIA6NHDLF2G7AIXUYDG]
aws_iam_user_policy_attachment.aleks: Refreshing state... [id=aleks-20230630022352782000000001]
module.mediapc.aws_iam_user_policy_attachment.backuper: Refreshing state... [id=twindb20230824154451928300000001-20230824154454441300000003]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-github-20230824154108908400000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=4181394228]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-admin]
data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230630023317121000000001]
aws_iam_role_policy_attachment.aws-admin: Refreshing state... [id=aws-admin-20230322021121795000000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-admin-20230703024608473400000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.tmp will be created
  + resource "aws_iam_access_key" "tmp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "tmp"
    }

  # aws_iam_user.tmp will be created
  + resource "aws_iam_user" "tmp" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "tmp"
      + path          = "/"
      + tags_all      = {
          + "created_by" = "infrahouse/aws-control-990466748045"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.tmp will be created
  + resource "aws_iam_user_policy_attachment" "tmp" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + user       = "tmp"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1268673852]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Reading...%0Adata.aws_iam_policy_document.allow-assume: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Aaws_iam_user.aleks: Refreshing state... [id=aleks]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Amodule.mediapc.aws_s3_bucket.dst: Refreshing state... [id=twindb20230824154451928300000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2054866892]%0Adata.aws_iam_policy_document.allow-assume: Read complete after 0s [id=2219106455]%0Aaws_iam_policy.allow-assume: Refreshing state... [id=arn:aws:iam::990466748045:policy/allow-assume]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::990466748045:policy/ih-tf-aws-control-github]%0Amodule.mediapc.data.aws_iam_policy_document.backuper-permissions: Reading...%0Amodule.mediapc.aws_iam_user.backuper: Refreshing state... [id=twindb20230824154451928300000001]%0Amodule.mediapc.data.aws_iam_policy_document.backuper-permissions: Read complete after 0s [id=2836020957]%0Amodule.mediapc.aws_iam_policy.backuper: Refreshing state... [id=arn:aws:iam::990466748045:policy/terraform-20230824154453948900000002]%0Adata.aws_iam_policy_document.aws-admin: Reading...%0Aaws_iam_access_key.aleks: Refreshing state... [id=AKIA6NHDLF2G665VS5V2]%0Adata.aws_iam_policy_document.aws-admin: Read complete after 0s [id=2092112735]%0Aaws_iam_role.aws-admin: Refreshing state... [id=aws-admin]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=1250416815]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-github]%0Amodule.mediapc.aws_iam_access_key.backuper: Refreshing state... [id=AKIA6NHDLF2G7AIXUYDG]%0Aaws_iam_user_policy_attachment.aleks: Refreshing state... [id=aleks-20230630022352782000000001]%0Amodule.mediapc.aws_iam_user_policy_attachment.backuper: Refreshing state... [id=twindb20230824154451928300000001-20230824154454441300000003]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-github-20230824154108908400000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=4181394228]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-admin]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230630023317121000000001]%0Aaws_iam_role_policy_attachment.aws-admin: Refreshing state... [id=aws-admin-20230322021121795000000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-admin-20230703024608473400000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_access_key.tmp will be created%0A  + resource "aws_iam_access_key" "tmp" {%0A      + create_date                    = (known after apply)%0A      + encrypted_secret               = (known after apply)%0A      + encrypted_ses_smtp_password_v4 = (known after apply)%0A      + id                             = (known after apply)%0A      + key_fingerprint                = (known after apply)%0A      + secret                         = (sensitive value)%0A      + ses_smtp_password_v4           = (sensitive value)%0A      + status                         = "Active"%0A      + user                           = "tmp"%0A    }%0A%0A  # aws_iam_user.tmp will be created%0A  + resource "aws_iam_user" "tmp" {%0A      + arn           = (known after apply)%0A      + force_destroy = false%0A      + id            = (known after apply)%0A      + name          = "tmp"%0A      + path          = "/"%0A      + tags_all      = {%0A          + "created_by" = "infrahouse/aws-control-990466748045"%0A        }%0A      + unique_id     = (known after apply)%0A    }%0A%0A  # aws_iam_user_policy_attachment.tmp will be created%0A  + resource "aws_iam_user_policy_attachment" "tmp" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + user       = "tmp"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC8wYmU2YzYzYy0wZWE2LTRmZmItYmQ1MC0yZDYwZDZiNWNkMjMvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXVxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hbGxvdy1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbmF3c19pYW1fdXNlci5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXVxubW9kdWxlLm1lZGlhcGMuYXdzX3MzX2J1Y2tldC5kc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYjIwMjMwODI0MTU0NDUxOTI4MzAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjA1NDg2Njg5Ml1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWxsb3ctYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE5MTA2NDU1XVxuYXdzX2lhbV9wb2xpY3kuYWxsb3ctYXNzdW1lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnBvbGljeS9hbGxvdy1hc3N1bWVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtZ2l0aHViXVxubW9kdWxlLm1lZGlhcGMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5iYWNrdXBlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyLmJhY2t1cGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGIyMDIzMDgyNDE1NDQ1MTkyODMwMDAwMDAwMV1cbm1vZHVsZS5tZWRpYXBjLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYmFja3VwZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4MzYwMjA5NTddXG5tb2R1bGUubWVkaWFwYy5hd3NfaWFtX3BvbGljeS5iYWNrdXBlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvdGVycmFmb3JtLTIwMjMwODI0MTU0NDUzOTQ4OTAwMDAwMDAyXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hd3MtYWRtaW46IFJlYWRpbmcuLi5cbmF3c19pYW1fYWNjZXNzX2tleS5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQTZOSERMRjJHNjY1VlM1VjJdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmF3cy1hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjA5MjExMjczNV1cbmF3c19pYW1fcm9sZS5hd3MtYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1hZG1pbl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI1MDQxNjgxNV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtZ2l0aHViXVxubW9kdWxlLm1lZGlhcGMuYXdzX2lhbV9hY2Nlc3Nfa2V5LmJhY2t1cGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1BS0lBNk5IRExGMkc3QUlYVVlER11cbmF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3MtMjAyMzA2MzAwMjIzNTI3ODIwMDAwMDAwMDFdXG5tb2R1bGUubWVkaWFwYy5hd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnQuYmFja3VwZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYjIwMjMwODI0MTU0NDUxOTI4MzAwMDAwMDAxLTIwMjMwODI0MTU0NDU0NDQxMzAwMDAwMDAzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1naXRodWItMjAyMzA4MjQxNTQxMDg5MDg0MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTgxMzk0MjI4XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWFkbWluXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtMjAyMzA2MzAwMjMzMTcxMjEwMDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYXdzLWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtYWRtaW4tMjAyMzAzMjIwMjExMjE3OTUwMDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgM3MgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtYWRtaW4tMjAyMzA3MDMwMjQ2MDg0NzM0MDAwMDAwMDFdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBhd3NfaWFtX2FjY2Vzc19rZXkudG1wIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9hY2Nlc3Nfa2V5XCIgXCJ0bXBcIiB7XG4gICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZW5jcnlwdGVkX3NlY3JldCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBlbmNyeXB0ZWRfc2VzX3NtdHBfcGFzc3dvcmRfdjQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsga2V5X2ZpbmdlcnByaW50ICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWNyZXQgICAgICAgICAgICAgICAgICAgICAgICAgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgKyBzZXNfc210cF9wYXNzd29yZF92NCAgICAgICAgICAgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgKyBzdGF0dXMgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkFjdGl2ZVwiXG4gICAgICArIHVzZXIgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidG1wXCJcbiAgICB9XG5cbiAgIyBhd3NfaWFtX3VzZXIudG1wIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV91c2VyXCIgXCJ0bXBcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZvcmNlX2Rlc3Ryb3kgPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgID0gXCJ0bXBcIlxuICAgICAgKyBwYXRoICAgICAgICAgID0gXCIvXCJcbiAgICAgICsgdGFnc19hbGwgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXG4gICAgICAgIH1cbiAgICAgICsgdW5pcXVlX2lkICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBhd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnQudG1wIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50XCIgXCJ0bXBcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NcIlxuICAgICAgKyB1c2VyICAgICAgID0gXCJ0bXBcIlxuICAgIH1cblxuUGxhbjogMyB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNjg2NzM4NTJdJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFsbG93LWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3VzZXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXSUwQW1vZHVsZS5tZWRpYXBjLmF3c19zM19idWNrZXQuZHN0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGIyMDIzMDgyNDE1NDQ1MTkyODMwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDU0ODY2ODkyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWxsb3ctYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE5MTA2NDU1XSUwQWF3c19pYW1fcG9saWN5LmFsbG93LWFzc3VtZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvYWxsb3ctYXNzdW1lXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC1naXRodWJdJTBBbW9kdWxlLm1lZGlhcGMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5iYWNrdXBlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5tZWRpYXBjLmF3c19pYW1fdXNlci5iYWNrdXBlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dHdpbmRiMjAyMzA4MjQxNTQ0NTE5MjgzMDAwMDAwMDFdJTBBbW9kdWxlLm1lZGlhcGMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5iYWNrdXBlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjgzNjAyMDk1N10lMEFtb2R1bGUubWVkaWFwYy5hd3NfaWFtX3BvbGljeS5iYWNrdXBlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvdGVycmFmb3JtLTIwMjMwODI0MTU0NDUzOTQ4OTAwMDAwMDAyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXdzLWFkbWluOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9hY2Nlc3Nfa2V5LmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1BS0lBNk5IRExGMkc2NjVWUzVWMl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmF3cy1hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjA5MjExMjczNV0lMEFhd3NfaWFtX3JvbGUuYXdzLWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtYWRtaW5dJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI1MDQxNjgxNV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWdpdGh1Yl0lMEFtb2R1bGUubWVkaWFwYy5hd3NfaWFtX2FjY2Vzc19rZXkuYmFja3VwZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFLSUE2TkhETEYyRzdBSVhVWURHXSUwQWF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3MtMjAyMzA2MzAwMjIzNTI3ODIwMDAwMDAwMDFdJTBBbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LmJhY2t1cGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGIyMDIzMDgyNDE1NDQ1MTkyODMwMDAwMDAwMS0yMDIzMDgyNDE1NDQ1NDQ0MTMwMDAwMDAwM10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1naXRodWItMjAyMzA4MjQxNTQxMDg5MDg0MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE4MTM5NDIyOF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtYWRtaW5dJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjMwMDIzMzE3MTIxMDAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hd3MtYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1hZG1pbi0yMDIzMDMyMjAyMTEyMTc5NTAwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgM3MgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWFkbWluLTIwMjMwNzAzMDI0NjA4NDczNDAwMDAwMDAxXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBhd3NfaWFtX2FjY2Vzc19rZXkudG1wIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fYWNjZXNzX2tleVwiIFwidG1wXCIgeyUwQSAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5jcnlwdGVkX3NlY3JldCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5jcnlwdGVkX3Nlc19zbXRwX3Bhc3N3b3JkX3Y0ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsga2V5X2ZpbmdlcnByaW50ICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjcmV0ICAgICAgICAgICAgICAgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICArIHNlc19zbXRwX3Bhc3N3b3JkX3Y0ICAgICAgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgKyBzdGF0dXMgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkFjdGl2ZVwiJTBBICAgICAgKyB1c2VyICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInRtcFwiJTBBICAgIH0lMEElMEEgICMgYXdzX2lhbV91c2VyLnRtcCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3VzZXJcIiBcInRtcFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmb3JjZV9kZXN0cm95ID0gZmFsc2UlMEEgICAgICArIGlkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgID0gXCJ0bXBcIiUwQSAgICAgICsgcGF0aCAgICAgICAgICA9IFwiL1wiJTBBICAgICAgKyB0YWdzX2FsbCAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiJTBBICAgICAgICB9JTBBICAgICAgKyB1bmlxdWVfaWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIGF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC50bXAgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50XCIgXCJ0bXBcIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc1wiJTBBICAgICAgKyB1c2VyICAgICAgID0gXCJ0bXBcIiUwQSAgICB9JTBBJTBBUGxhbjogMyB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDMsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>